{
  "digital_hording": {
    "title": "Why Deleting Files Feels Like Deleting Memories",
    "description": "Do you have thousands of screenshots you’ll never watch or old emails you’re afraid to delete?\nIn this video, we dive into digital hoarding—the excessive accumulation and reluctance to delete digital files, from photos to documents.\n\nWe explore:\n• Fear of Loss: The anxiety that you might need a piece of information later.\n• Sentimental Attachment: How digital files carry emotional weight.\n• Identity Preservation: Why deleting files can feel like erasing a part of yourself.\n• Decision Paralysis: How data overload causes procrastination and overwhelm.\n\nDigital files don’t take physical space, but they create mental clutter, reduce productivity, and increase security risks.\nLearn how psychological ownership and digital object attachment blur the line between your offline and digital identities.",
    "tags": [
      "digital hoarding",
      "digital clutter",
      "why we cant delete files",
      "psychological ownership",
      "digital object attachment",
      "mental overwhelm",
      "identity formation",
      "data hoarding",
      "screenshot addiction"
    ]
  },

  "phantom_buzz": {
    "title": "How Your Brain Creates Fake Phone Vibrations (Neuroscience Breakdown)",
    "description": "Have you ever sworn your phone buzzed, only to check and find nothing?\nThis is Phantom Pocket Vibration Syndrome.\n\nWhat you’ll learn:\n• Anticipatory Anxiety: Why our brain waits for notifications.\n• Brain Chemistry: Cortisol, norepinephrine, and overstimulation.\n• FOMO Response: Why missing messages feels threatening.\n• Tech Anxiety: How constant checking increases stress and distraction.\n\nRetraining the brain:\n• Take 10-minute tech breaks every 90-120 minutes.\n• Nature walks, meditation, exercise.\n• Check messages on a schedule instead of compulsively.\n\nFeaturing insights from Dr. Michelle Drouin & Dr. Larry Rosen.",
    "tags": [
      "phantom vibration syndrome",
      "phantom phone buzz",
      "ghost notifications",
      "technology anxiety",
      "phone addiction",
      "FOMO psychology",
      "neuroscience explained",
      "stress and cortisol",
      "mental health tech"
    ]
  },

  "toxicity_online_gaming": {
    "title": "Why High-Rank Players Bully Noobs: The Psychology No One Talks About",
    "description": "Why do high-rank players bully new players, and what does 'griefing' do to our brains?\nThis video breaks down Self-Determination Theory (SDT) to show how toxic behavior impacts autonomy, competence, and relatedness.\n\nKey insights:\n• The Griefer's High: Power, control, and emotional reward.\n• The Smurfing Paradox: Why players cheat for easier matches.\n• Need Frustration: How harassment destroys connection and wellbeing.\n\nThis isn’t just gameplay — it’s psychology.",
    "tags": [
      "gaming toxicity",
      "griefing psychology",
      "why gamers bully",
      "smurfing explained",
      "online harassment gaming",
      "self determination theory",
      "toxic gaming behavior",
      "esports mental health",
      "high rank gamer behavior"
    ]
  }
}
